Revit 2027 API
IFCExternalServiceUIData Methods
The IFCExternalServiceUIData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParentHwnd |  return the parent handle
GetRevitElementIds |  return the list of revit Element Ids
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace